app/controllers/fuentes_controller.rb

  def index
    @fuentes = Fuente.all
---
SELECT * FROM "fuentes"

  def show
    @fuente = Fuente.find(params[:id])
---
SELECT * FROM "fuentes" WHERE ("fuentes"."id" = 4)

  def destroy
    @fuente = Fuente.find(params[:id])
    @fuente.destroy
---
SELECT * FROM "fuentes" WHERE ("fuentes"."id" = 4)
DELETE FROM "fuentes" WHERE "id" = 4