app/controllers/pia_ocotals_proyectos_controller.rb

SELECT * FROM "pia_ocotals_proyectos"
---
  def index
    @pia_ocotals_proyectos = PiaOcotalsProyecto.all

SELECT * FROM "pia_ocotals_proyectos" WHERE ("pia_ocotals_proyectos"."id" = 1)
---
  def show
    @pia_ocotals_proyecto = PiaOcotalsProyecto.find(params[:id])

INSERT INTO "pia_ocotals_proyectos" ("pia_ocotal_id", "proyecto_id", "created_at", "updated_at") VALUES(1, 1, '2010-07-27 17:27:20', '2010-07-27 17:27:20')
---
  def create
    @pia_ocotals_proyecto = PiaOcotalsProyecto.new(params[:pia_ocotals_proyecto])

    respond_to do |format|
      if @pia_ocotals_proyecto.save