app/controllers/pia_ocotals_controller.rb

  def index
    @pia_ocotals = PiaOcotal.all
---
SELECT * FROM "pia_ocotals"

  def show
    @pia_ocotal = PiaOcotal.find(params[:id])
---
SELECT * FROM "pia_ocotals" WHERE ("pia_ocotals"."id" = 1)

  def edit
    @pia_ocotal = PiaOcotal.find(params[:id])
---
SELECT * FROM "pia_ocotals" WHERE ("pia_ocotals"."id" = 1)

  def create
    @pia_ocotal = PiaOcotal.new(params[:pia_ocotal])

    respond_to do |format|
      if @pia_ocotal.save
---
INSERT INTO "pia_ocotals" ("created_at", "nombre", "updated_at", "fecha") VALUES('2010-07-27 17:24:39', '', '2010-07-27 17:24:39', '2010-07-27')

  def update
    @pia_ocotal = PiaOcotal.find(params[:id])

    respond_to do |format|
      if @pia_ocotal.update_attributes(params[:pia_ocotal])
---
SELECT * FROM "pia_ocotals" WHERE ("pia_ocotals"."id" = 1)
UPDATE "pia_ocotals" SET "updated_at" = '2010-07-27 17:25:55', "nombre" = 'Elaboracion Octubre 2011', "fecha" = '2010-10-19' WHERE "id" = 1