app/controllers/proyectos_controller.rb

  def show
    @proyecto = Proyecto.find(params[:id])
---
SELECT * FROM "proyectos" WHERE ("proyectos"."id" = 2)

  def edit
    @proyecto = Proyecto.find(params[:id])
---
SELECT * FROM "proyectos" WHERE ("proyectos"."id" = 1)

  def create
    @proyecto = Proyecto.new(params[:proyecto])

    respond_to do |format|
      if @proyecto.save
---
INSERT INTO "proyectos" ("plazo_ejecucion", "fecha_inicio", "fecha_final", "equipos", "otros_costos", "sector_id", "materiales", "created_at", "municipio", "costo_inversion", "estado_id", "justificacion", "empleos_hombres", "updated_at", "descripcion", "mano_obra", "empleos_mujeres", "departamento", "nombre_proyecto", "tipo_proy_id", "gasto_general", "ubicacion_id", "contratacion_id", "objetivos_metas") VALUES(NULL, '2010-07-27', '2010-07-27', NULL, NULL, NULL, NULL, '2010-07-27 17:42:33', '', NULL, NULL, '', NULL, '2010-07-27 17:42:33', '1', NULL, NULL, '', 'construccion de vivienda', NULL, NULL, NULL, NULL, '')

  def update
    @proyecto = Proyecto.find(params[:id])

    respond_to do |format|
      if @proyecto.update_attributes(params[:proyecto])
---
SELECT * FROM "proyectos" WHERE ("proyectos"."id" = 2)
UPDATE "proyectos" SET "updated_at" = '2010-07-30 17:50:02', "otros_costos" = 23.0, "materiales" = 2345.0, "mano_obra" = 1200.0, "gasto_general" = 300.0, "equipos" = 3004.0 WHERE "id" = 9