app/controllers/tipo_fuentes_controller.rb

  def index
    @tipo_fuentes = TipoFuente.all
---
SELECT * FROM "tipo_fuentes"

  def show
    @tipo_fuente = TipoFuente.find(params[:id])
---
SELECT * FROM "tipo_fuentes" WHERE ("tipo_fuentes"."id" = 1)

  def edit
    @tipo_fuente = TipoFuente.find(params[:id])
---
SELECT * FROM "tipo_fuentes" WHERE ("tipo_fuentes"."id" = 4)

  def create
    @tipo_fuente = TipoFuente.new(params[:tipo_fuente])

    respond_to do |format|
      if @tipo_fuente.save
---
INSERT INTO "tipo_fuentes" ("created_at", "updated_at", "descripcion") VALUES('2010-07-30 16:59:52', '2010-07-30 16:59:52', 'Transferencias')

  def update
    @tipo_fuente = TipoFuente.find(params[:id])

    respond_to do |format|
      if @tipo_fuente.update_attributes(params[:tipo_fuente])
---
SELECT * FROM "tipo_fuentes" WHERE ("tipo_fuentes"."id" = 4)
UPDATE "tipo_fuentes" SET "updated_at" = '2010-07-30 17:01:42', "descripcion" = 'Rubi Solidario' WHERE "id" = 4